## Pandas

- 1D ---->   Series 
- 2D  ----->  DataFrame

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
pd.Series([10,20,30])

0    10
1    20
2    30
dtype: int64

In [4]:
a = pd.Series(range(100,200 , 10 )  , dtype=float)

In [5]:
a.dtype

dtype('float64')

In [6]:
pd.Series(10)

0    10
dtype: int64

In [7]:
pd.Series(np.arange(10 , 100 , 10))

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [8]:
name = ["mohit" , "ravi" , "raju"]

In [9]:
age = [30 , 40 , 50 ]

In [10]:
d = { "name" : name , "age" : age}

In [11]:
df = pd.DataFrame(d)

In [12]:
df["name"]

0    mohit
1     ravi
2     raju
Name: name, dtype: object

In [13]:
df["location"] = ["Noida" , "Delhi" , "Bhadurgarh"]

In [14]:
df["rank"] = range(300 , 309 , 3)

In [15]:
df

    name  age    location  rank
0  mohit   30       Noida   300
1   ravi   40       Delhi   303
2   raju   50  Bhadurgarh   306

In [16]:
pd.Series( [10,20 ,30 ,40] , ["a" , "b" , "c" , "d"] )

a    10
b    20
c    30
d    40
dtype: int64

In [17]:
pd.Series({ "A" : 10 ,"B" : 30 , "C" : 40 , "D" : 70 })

A    10
B    30
C    40
D    70
dtype: int64

In [18]:
a= pd.Series(["A Sweet red Fruit " , "King of Fruit "], index=["Apple"  , "mango"])

In [19]:
a["Apple"]

'A Sweet red Fruit '

In [20]:
d = {"Apple" : "Sweet Red" , "Mango" : "King"}

In [21]:
pd.Series(d)

Apple    Sweet Red
Mango         King
dtype: object

In [22]:
e = dict(zip(name , age))

In [23]:
pd.Series(e)

mohit    30
ravi     40
raju     50
dtype: int64

In [24]:
list(d)

['Apple', 'Mango']

In [25]:
arr = np.random.randint(10,20 , (5,5))

In [26]:
arr

array([[11, 12, 13, 18, 12],
       [12, 12, 17, 17, 17],
       [17, 19, 13, 15, 11],
       [18, 18, 16, 14, 11],
       [17, 10, 18, 19, 13]])

In [27]:
pd.DataFrame(arr)

    0   1   2   3   4
0  11  12  13  18  12
1  12  12  17  17  17
2  17  19  13  15  11
3  18  18  16  14  11
4  17  10  18  19  13

In [28]:
name = ["Anuj" ,"Mohan" , "Hari" , "Bharat" , "Ravi"]

In [29]:
subjects = ["Phy" , "Chem" , "Math" , "Eng" , "Bio"]

In [30]:
df = pd.DataFrame(arr ,index=name , columns = subjects)

In [31]:
df

        Phy  Chem  Math  Eng  Bio
Anuj     11    12    13   18   12
Mohan    12    12    17   17   17
Hari     17    19    13   15   11
Bharat   18    18    16   14   11
Ravi     17    10    18   19   13

In [32]:
df.to_html("data.html")

### From html to pandas table

In [33]:
out = pd.read_html("data.html")

In [34]:
out

[  Unnamed: 0  Phy  Chem  Math  Eng  Bio
 0       Anuj   11    12    13   18   12
 1      Mohan   12    12    17   17   17
 2       Hari   17    19    13   15   11
 3     Bharat   18    18    16   14   11
 4       Ravi   17    10    18   19   13]

In [35]:
out[0]

  Unnamed: 0  Phy  Chem  Math  Eng  Bio
0       Anuj   11    12    13   18   12
1      Mohan   12    12    17   17   17
2       Hari   17    19    13   15   11
3     Bharat   18    18    16   14   11
4       Ravi   17    10    18   19   13

In [36]:
out = pd.read_html("https://www.w3schools.com/html/html_tables.asp")

In [37]:
out[0]

                        Company           Contact  Country
0           Alfreds Futterkiste      Maria Anders  Germany
1    Centro comercial Moctezuma   Francisco Chang   Mexico
2                  Ernst Handel     Roland Mendel  Austria
3                Island Trading     Helen Bennett       UK
4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy

In [38]:
out = pd.read_html("https://developer.mozilla.org/en-US/docs/Web/HTML/Element/table")

In [39]:
out[1]

                                       Specification           Status  Comment
0  HTML Living StandardThe definition of 'table e...  Living Standard      NaN
1  HTML5The definition of 'table element' in that...   Recommendation      NaN

In [40]:
df.to_csv("data.csv")

### From csv to pandas table

In [41]:
pd.read_csv("data.csv" , index_col = 0 )

        Phy  Chem  Math  Eng  Bio
Anuj     11    12    13   18   12
Mohan    12    12    17   17   17
Hari     17    19    13   15   11
Bharat   18    18    16   14   11
Ravi     17    10    18   19   13

In [42]:
a = df.head(10)

In [43]:
type(a)

pandas.core.frame.DataFrame

In [44]:
df.tail(2)

        Phy  Chem  Math  Eng  Bio
Bharat   18    18    16   14   11
Ravi     17    10    18   19   13

In [45]:
df.iloc[2:4]

        Phy  Chem  Math  Eng  Bio
Hari     17    19    13   15   11
Bharat   18    18    16   14   11

In [46]:
df.iloc[2: , 2:4]

        Math  Eng
Hari      13   15
Bharat    16   14
Ravi      18   19

In [47]:
df.iloc[::2 , 2:4]

      Math  Eng
Anuj    13   18
Hari    13   15
Ravi    18   19

In [48]:
df.iloc[1,1]

12

In [49]:
df.iat[1,1]

12

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Anuj to Ravi
Data columns (total 5 columns):
Phy     5 non-null int64
Chem    5 non-null int64
Math    5 non-null int64
Eng     5 non-null int64
Bio     5 non-null int64
dtypes: int64(5)
memory usage: 400.0+ bytes

In [51]:
df.describe()

            Phy       Chem       Math        Eng       Bio
count   5.00000   5.000000   5.000000   5.000000   5.00000
mean   15.00000  14.200000  15.400000  16.600000  12.80000
std     3.24037   4.024922   2.302173   2.073644   2.48998
min    11.00000  10.000000  13.000000  14.000000  11.00000
25%    12.00000  12.000000  13.000000  15.000000  11.00000
50%    17.00000  12.000000  16.000000  17.000000  12.00000
75%    17.00000  18.000000  17.000000  18.000000  13.00000
max    18.00000  19.000000  18.000000  19.000000  17.00000

In [52]:
df.sort_index()

        Phy  Chem  Math  Eng  Bio
Anuj     11    12    13   18   12
Bharat   18    18    16   14   11
Hari     17    19    13   15   11
Mohan    12    12    17   17   17
Ravi     17    10    18   19   13

In [53]:
df.sort_values("Phy" , axis=0)

        Phy  Chem  Math  Eng  Bio
Anuj     11    12    13   18   12
Mohan    12    12    17   17   17
Hari     17    19    13   15   11
Ravi     17    10    18   19   13
Bharat   18    18    16   14   11

In [54]:
df.sort_values("Anuj"  , axis = 1)

        Phy  Chem  Bio  Math  Eng
Anuj     11    12   12    13   18
Mohan    12    12   17    17   17
Hari     17    19   11    13   15
Bharat   18    18   11    16   14
Ravi     17    10   13    18   19

In [55]:
df.sort_values(["Ravi" , "Mohan"] , axis=1)

        Chem  Bio  Phy  Math  Eng
Anuj      12   12   11    13   18
Mohan     12   17   12    17   17
Hari      19   11   17    13   15
Bharat    18   11   18    16   14
Ravi      10   13   17    18   19

In [56]:
df["Chem"]

Anuj      12
Mohan     12
Hari      19
Bharat    18
Ravi      10
Name: Chem, dtype: int64

In [57]:
df[["Chem" , "Math"]]

        Chem  Math
Anuj      12    13
Mohan     12    17
Hari      19    13
Bharat    18    16
Ravi      10    18

In [58]:
## df.drop(["Phy" , "Chem"] , axis  =1 , inplace =True)

In [59]:
df

        Phy  Chem  Math  Eng  Bio
Anuj     11    12    13   18   12
Mohan    12    12    17   17   17
Hari     17    19    13   15   11
Bharat   18    18    16   14   11
Ravi     17    10    18   19   13

In [61]:
df.loc[["Anuj", "Bharat"] , ["Phy" , "Eng"]]

        Phy  Eng
Anuj     11   18
Bharat   18   14

In [62]:
df.loc[df.index > "Mohan"]

      Phy  Chem  Math  Eng  Bio
Ravi   17    10    18   19   13

In [63]:
df.loc[df["Chem"] > 10]

        Phy  Chem  Math  Eng  Bio
Anuj     11    12    13   18   12
Mohan    12    12    17   17   17
Hari     17    19    13   15   11
Bharat   18    18    16   14   11

In [69]:
df.loc[(df["Chem"] > 10 ) & (df["Eng"] > 15)]

       Phy  Chem  Math  Eng  Bio
Anuj    11    12    13   18   12
Mohan   12    12    17   17   17

In [71]:
df.groupby(["Chem"]).mean()

       Phy  Math   Eng   Bio
Chem
10    17.0  18.0  19.0  13.0
12    11.5  15.0  17.5  14.5
18    18.0  16.0  14.0  11.0
19    17.0  13.0  15.0  11.0